use core::num;

/*
给定 n 个整数，找出平均数最大且长度为 k 的连续子数组，并输出该最大平均数。

示例：

输入：[1,12,-5,-6,50,3], k = 4
输出：12.75
解释：最大平均数 (12-5-6+50)/4 = 51/4 = 12.75

提示：

1 <= k <= n <= 30,000。
所给数据范围 [-10,000，10,000]。

来源：力扣（LeetCode）
链接：https://leetcode-cn.com/problems/maximum-average-subarray-i
著作权归领扣网络所有。商业转载请联系官方授权，非商业转载请注明出处。
*/

pub fn find_max_average(nums: Vec<i32>, k: i32) -> f64 {
    let mut sum = 0;
    for j in 0..k as usize {
        sum += nums[j];
    }
    let mut max: f64 = sum as f64;
    for i in 1..nums.len() - k as usize + 1 {
        sum += nums[i + k as usize - 1] - nums[i-1];
        max = max.max(sum as f64)
    }
    max / k as f64
}

#[test]
fn t1() {
    assert_eq!(12.75, find_max_average(vec![1,12,-5,-6,50,3], 4));
}

#[test]
fn t2() {
    assert_eq!(-1.0, find_max_average(vec![-1], 1));
}

#[test]
fn t3() {
    let a = vec![8860,-853,6534,4477,-4589,8646,-6155,-5577,-1656,-5779,-2619,-8604,-1358,-8009,4983,7063,3104,-1560,4080,2763,5616,-2375,2848,1394,-7173,-5225,-8244,-809,8025,-4072,-4391,-9579,1407,6700,2421,-6685,5481,-1732,-8892,-6645,3077,3287,-4149,8701,-4393,-9070,-1777,2237,-3253,-506,-4931,-7366,-8132,5406,-6300,-275,-1908,67,3569,1433,-7262,-437,8303,4498,-379,3054,-6285,4203,6908,4433,3077,2288,9733,-8067,3007,9725,9669,1362,-2561,-4225,5442,-9006,-429,160,-9234,-4444,3586,-5711,-9506,-79,-4418,-4348,-5891];
    assert_eq!(-594.58065, find_max_average(a, 93));
}